// Напишите программу, которая принимает случайное число любой разрядности и удаляет вторую цифру этого числа.

Console.WriteLine("Введи число: ");
int num = Convert.ToInt32(Console.ReadLine());
int tnd = 1;
int count = math.log10(num);

не решено